<a href="https://colab.research.google.com/github/kimys0279/Kaggle/blob/main/Pandas_Tutorial_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [72]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [73]:
list_data = [1, 2, 3, 4, 5]
list_name = ['a', 'b', 'c', 'd', 'e']
example_obj = Series(data = list_data, index = list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [74]:
dict_data = {'a':1, 'b':2, "c":3, "d":4, "e":5}
example_obj2 = Series(dict_data, dtype = np.float32, name = "example_data")
example_obj2

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [75]:
example_obj["a"]

1

In [76]:
example_obj["a"] = 3.2
example_obj

a    3
b    2
c    3
d    4
e    5
dtype: int64

In [77]:
example_obj[example_obj > 3]

d    4
e    5
dtype: int64

In [78]:
example_obj.to_dict()

{'a': 3, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [79]:
example_obj.values

array([3, 2, 3, 4, 5])

In [80]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [81]:
example_obj.name = "number"
example_obj.index_name = 'alphabet'
example_obj

a    3
b    2
c    3
d    4
e    5
Name: number, dtype: int64

In [82]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a", "b", "c", "d", "e", "f", "g", "h"]
series_obj_1 = Series(dict_data_1, index = indexes)
series_obj_1

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [83]:
#Dataframe Overview

# Numpy array-like
# Each column can have a different type
# Row and column index
# Size mutable: Insert and delete columns

In [84]:
raw_data = {'first_name': ['Jason', "Molly", "Tina", "Jake", "Amy"],
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
            'age': [42, 52, 36, 24, 73],
            'city': ['SF', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name','last_name', 'age', 'city'])
df

  first_name last_name  age       city
0      Jason    Miller   42         SF
1      Molly  Jacobson   52  Baltimore
2       Tina       Ali   36      Miami
3       Jake    Milner   24    Douglas
4        Amy     Cooze   73     Boston

In [85]:
DataFrame(raw_data, columns = ['age', 'city'])

   age       city
0   42         SF
1   52  Baltimore
2   36      Miami
3   24    Douglas
4   73     Boston

In [86]:
DataFrame(raw_data, columns = ['first_name','last_name', 'age', 'city', 'debt'])

  first_name last_name  age       city debt
0      Jason    Miller   42         SF  NaN
1      Molly  Jacobson   52  Baltimore  NaN
2       Tina       Ali   36      Miami  NaN
3       Jake    Milner   24    Douglas  NaN
4        Amy     Cooze   73     Boston  NaN

In [87]:
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])
df.first_name          #series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [88]:
df['first_name']           #series 추출

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [89]:
df.loc[1]         #loc - index location

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [90]:
df['age'].iloc[1:]          #iloc - index position

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [91]:
s = pd.Series(np.nan, index = [49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
s.loc[:3]        #loc - index location, index 이름 기준

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [92]:
s.iloc[:3]        #iloc - index position, index number 기준

49   NaN
48   NaN
47   NaN
dtype: float64

In [93]:
df.debt = df.age > 40
df

  first_name last_name  age       city   debt
0      Jason    Miller   42         SF   True
1      Molly  Jacobson   52  Baltimore   True
2       Tina       Ali   36      Miami  False
3       Jake    Milner   24    Douglas  False
4        Amy     Cooze   73     Boston   True

In [94]:
df.T

                 0          1      2        3       4
first_name   Jason      Molly   Tina     Jake     Amy
last_name   Miller   Jacobson    Ali   Milner   Cooze
age             42         52     36       24      73
city            SF  Baltimore  Miami  Douglas  Boston
debt          True       True  False    False    True

In [95]:
df.values

array([['Jason', 'Miller', 42, 'SF', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [96]:
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,SF,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [97]:
del df['debt']
df

  first_name last_name  age       city
0      Jason    Miller   42         SF
1      Molly  Jacobson   52  Baltimore
2       Tina       Ali   36      Miami
3       Jake    Milner   24    Douglas
4        Amy     Cooze   73     Boston

In [98]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [102]:
values = Series(data = ['M', "F", "F"], index = [0, 1, 3])
values

0    M
1    F
3    F
dtype: object

In [105]:
df['sex'] = values
df

  first_name last_name  age       city  sex
0      Jason    Miller   42         SF    M
1      Molly  Jacobson   52  Baltimore    F
2       Tina       Ali   36      Miami  NaN
3       Jake    Milner   24    Douglas    F
4        Amy     Cooze   73     Boston  NaN

In [ ]:
#Selection & Drop

In [109]:
raw_data2 = {'account': [211829, 320563, 648336], 'street': ['34456 Sean Highway', '1311 Alvis Tunnel', '1505 Hillsborough St'], 'state': ['Texas', 'Iowa', 'NorthCarolina']}
df = pd.DataFrame(raw_data2, columns = ['account', 'street', 'state'])
df['account'].head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [110]:
df[['account', 'street', 'state']].head(3)

   account                street          state
0   211829    34456 Sean Highway          Texas
1   320563     1311 Alvis Tunnel           Iowa
2   648336  1505 Hillsborough St  NorthCarolina

In [113]:
account_series = df['account']
account_series[:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [ ]:
#DataFrame Operation

In [117]:
s1 = Series(range(1, 6), index = list('abcde'))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [118]:
s2 = Series(range(5, 11), index = list('bcedef'))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [119]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [120]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [122]:
s1.add(s2, fill_value = 0)

a     1.0
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f    10.0
dtype: float64

In [123]:
df1 = DataFrame(np.arange(9).reshape(3, 3), columns = list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [124]:
df2 = DataFrame(np.arange(16).reshape(4, 4), columns = list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [125]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [126]:
df1.add(df2, fill_value = 0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [127]:
df = DataFrame(np.arange(16).reshape(4, 4), columns = list('abcd'))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [128]:
s = Series(np.arange(10, 14), index = list('abcd'))
s

a    10
b    11
c    12
d    13
dtype: int64

In [129]:
df+s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [130]:
s2 = Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int64

In [131]:
df+s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [132]:
df.add(s2, axis = 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

In [133]:
#Lambda 함수
# 한 줄로 함수를 표현하는 익명 함수 기법
def f(x, y):
  return x + y

f = lambda x, y: x + y
f(1, 4)

f = lambda x : x / 2
f(3)

f = lambda x: x ** 2
f(3)

(lambda x:x + 1)(5)

6

In [134]:
#map 함수
# 함수와 sequence 형 데이터를 인자로 받아 각 element 마다 입력받은 함수를 적용하여 list로 반환

ex = [1, 2, 3, 4, 5]
f = lambda x: x** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [135]:
f = lambda x, y: x+y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [136]:
list(map(lambda x: x+x, ex))  #map함수를 쓸 때는 list를 반드시 써야 함

[2, 4, 6, 8, 10]

In [138]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [139]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [140]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [141]:
s2 = Series(np.arange(10, 20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [ ]:
#Pandas BUiltin function

In [143]:
df.describe()

               a          b          c          d
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000